<?

$str = "英雄赞歌".
       "烽烟滚滚唱英雄,四面青山侧耳听,侧耳听".
       "青天响雷敲金鼓,大海扬波作和声".
       "人民战士驱虎豹,舍生忘死保和平".
       "为什么战旗美如画,英雄的鲜血染红了她".
       "为什么大地春常在,英雄的生命开鲜花".
       "英雄猛跳出战壕,一道电光裂长空,裂长空".
       "地陷进去独身挡,天塌下来只手擎".
       "两脚熊熊趟烈火,浑身闪闪披彩虹".
       "为什么战旗美如画,英雄的鲜血染红了她".
       "为什么大地春常在,英雄的生命开鲜花".
       "一声呼叫炮声隆,倒海翻江天地崩,天地崩".
       "双手紧握爆破筒,怒目喷火热血涌".
       "敌人腐烂变泥土,勇士辉煌化金星".
       "为什么战旗美如画,雄的鲜血染红了她".
       "为什么大地春常在,英雄的生命开鲜花";

echo "当前进程号: ".getmypid();

//ACMatcher::build('字典名', '缓存时长', '函数名');
//ACMatcher::build('字典名', '缓存时长', array($object, 'method');

ACMatcher::build('hi', 120, function () {
    // ...... 返回数组
    return [
        '为什么',
        '花儿',
        '红',
        "美如画",
        "英雄",
        "画",
        [
            '敌人',
            '鲜花',
            'lists' => [ 1, 2, 3, 4, 5, 6, 7]
        ]
    ];
});

/**
* 不是一个进程不要用add方法来增加字典
*/
ACMatcher::add('hi', function() {
    return ['北京'];
});

echo "<br><br>--------------------------------<br><br>";

$has = ACMatcher::match("hi", "一起盘他");
echo "字典命中结果: "; var_dump($has);

echo "<br><br>--------------------------------<br><br>";

echo "匹配结果:<br>";
$arr = ACMatcher::search("hi", $str);

echo "<pre>";var_dump($arr);echo "<pre>";

echo "<br><br>--------------------------------<br><br>";

echo "打印字典信息……<br><br>";

ACMatcher::print('hi');

echo "<br>--------------------------------<br><br>";

echo "当前字典hi缓存是否存在: "; var_dump(ACMatcher::has('hi'));

echo "<br>--------------------------------<br><br>";

echo "删除字典hi结果: "; var_dump(ACMatcher::destroy('hi'));

echo "<br>--------------------------------<br><br>";

echo "删除后字典hi缓存是否存在: "; var_dump(ACMatcher::has('hi'));